# Pandas : ( Part 2 )
# Topics :
### - dict(zip( , )) 
### - Filtering: df[df['']==''] , df[(df['']=='') & (df['']=='')]
### - adding series to dataframe in col: df['']=df1
### - .sort_values() , .sort_values('') , .sort_values('',ascending=False) , .set_index('') , .reset_index('')
### - Pivot table...

In [238]:
import numpy as np
import pandas as pd

a=['jan','feb','march']
b=[31,28,31]
a

['jan', 'feb', 'march']

In [239]:
b

[31, 28, 31]

In [240]:
d=dict(zip(a,b))
d

{'jan': 31, 'feb': 28, 'march': 31}

In [241]:
df=pd.DataFrame({'name':['kasim','aftab','danish','kulna'],'age':[25,22,23,24],'gender':['male','male','male','female'],'occupation':list(range(1,5)),'perchacing car or not':['yes','no','yes','no']})

In [242]:
df

     name  age  gender  occupation perchacing car or not
0   kasim   25    male           1                   yes
1   aftab   22    male           2                    no
2  danish   23    male           3                   yes
3   kulna   24  female           4                    no

In [243]:
df[df['perchacing car or not']=='yes']

     name  age gender  occupation perchacing car or not
0   kasim   25   male           1                   yes
2  danish   23   male           3                   yes

In [244]:
df

     name  age  gender  occupation perchacing car or not
0   kasim   25    male           1                   yes
1   aftab   22    male           2                    no
2  danish   23    male           3                   yes
3   kulna   24  female           4                    no

In [245]:
df[(df['perchacing car or not']=='yes') & (df['gender']=='female')]

Empty DataFrame
Columns: [name, age, gender, occupation, perchacing car or not]
Index: []

In [246]:
type(df[['name','age']])

pandas.core.frame.DataFrame

In [247]:
df1=pd.DataFrame(dict(a=list(range(1,5))))
df1

   a
0  1
1  2
2  3
3  4

In [248]:
df2=pd.Series(list(range(0,4)))
df2

0    0
1    1
2    2
3    3
dtype: int64

In [249]:
df['id']=df2
df                #adding series to a dataframe in column

     name  age  gender  occupation perchacing car or not  id
0   kasim   25    male           1                   yes   0
1   aftab   22    male           2                    no   1
2  danish   23    male           3                   yes   2
3   kulna   24  female           4                    no   3

In [250]:
l=[1,3,2]

In [251]:
sorted(l)

[1, 2, 3]

In [252]:
l.sort()
l

[1, 2, 3]

In [253]:
l.sort(reverse=True)
l

[3, 2, 1]

In [254]:
a=df['age']
a

0    25
1    22
2    23
3    24
Name: age, dtype: int64

In [255]:
a.sort_values()

1    22
2    23
3    24
0    25
Name: age, dtype: int64

In [256]:
df.sort_values('age')

     name  age  gender  occupation perchacing car or not  id
1   aftab   22    male           2                    no   1
2  danish   23    male           3                   yes   2
3   kulna   24  female           4                    no   3
0   kasim   25    male           1                   yes   0

In [257]:
df.sort_values('age',ascending=False)

     name  age  gender  occupation perchacing car or not  id
0   kasim   25    male           1                   yes   0
3   kulna   24  female           4                    no   3
2  danish   23    male           3                   yes   2
1   aftab   22    male           2                    no   1

In [258]:
df.sort_values('age')

     name  age  gender  occupation perchacing car or not  id
1   aftab   22    male           2                    no   1
2  danish   23    male           3                   yes   2
3   kulna   24  female           4                    no   3
0   kasim   25    male           1                   yes   0

In [262]:
df=df.set_index('id')

In [263]:
df

      name  age  gender  occupation perchacing car or not
id
0    kasim   25    male           1                   yes
1    aftab   22    male           2                    no
2   danish   23    male           3                   yes
3    kulna   24  female           4                    no

In [268]:
df=df.reset_index()

In [269]:
df

   index  id    name  age  gender  occupation perchacing car or not
0      0   0   kasim   25    male           1                   yes
1      1   1   aftab   22    male           2                    no
2      2   2  danish   23    male           3                   yes
3      3   3   kulna   24  female           4                    no

In [278]:
adf=pd.DataFrame(dict(A=['foo','foo','bar','bar'],
    B=['one','one','two','two'],
    C=['x','y','x','y'],
    D=[1,3,5,6]))
adf

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  bar  two  x  5
3  bar  two  y  6

In [285]:
pivot_adf=adf.pivot_table(values='D',
                       index='A',
                       columns=['C'],          
                       aggfunc=np.sum)
pivot_adf                                  #Pivot table...

C    x  y
A
bar  5  6
foo  1  3

In [ ]:
# To be continued...